cool/tutorials/multiphase/compressibleInterFoam/les/depthCharge2D/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha1 1
    volScalarFieldValue p 1e5
);

regions
(
    sphereToCell
    {
        centre (0.5 0.5 0);
        radius 0.1;

        fieldValues
        (
            volScalarFieldValue alpha1 0
            volScalarFieldValue p 10e5
        );
    }

    boxToCell
    {
        box (-10 1 -1) (10 10 1);

        fieldValues
        (
            volScalarFieldValue alpha1 0
        );
    }
);

// ************************************************************************* //
